applications/solvers/bubblesFoam/pitzDaily/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


(

    (-0.01 0.001 0)
    (-0.01 0.002 0)
    (-0.01 0.003 0)
    (-0.01 0.004 0)
    (-0.01 0.005 0)
    (-0.01 0.006 0)
    (-0.01 0.007 0)
    (-0.01 0.008 0)
    (-0.01 0.009 0)
    (-0.01 0.010 0)
    (-0.01 0.011 0)
    (-0.01 0.012 0)
    (-0.01 0.013 0)
    (-0.01 0.014 0)
    (-0.01 0.015 0)
    (-0.01 0.016 0)
    (-0.01 0.017 0)
    (-0.01 0.018 0)
    (-0.01 0.019 0)
    (-0.01 0.020 0)


    (-0.0075 0.001 0)
    (-0.0075 0.002 0)
    (-0.0075 0.003 0)
    (-0.0075 0.004 0)
    (-0.0075 0.005 0)
    (-0.0075 0.006 0)
    (-0.0075 0.007 0)
    (-0.0075 0.008 0)
    (-0.0075 0.009 0)
    (-0.0075 0.010 0)
    (-0.0075 0.011 0)
    (-0.0075 0.012 0)
    (-0.0075 0.013 0)
    (-0.0075 0.014 0)
    (-0.0075 0.015 0)
    (-0.0075 0.016 0)
    (-0.0075 0.017 0)
    (-0.0075 0.018 0)
    (-0.0075 0.019 0)
    (-0.0075 0.020 0)

    (-0.005 0.001 0)
    (-0.005 0.002 0)
    (-0.005 0.003 0)
    (-0.005 0.004 0)
    (-0.005 0.005 0)
    (-0.005 0.006 0)
    (-0.005 0.007 0)
    (-0.005 0.008 0)
    (-0.005 0.009 0)
    (-0.005 0.010 0)
    (-0.005 0.011 0)
    (-0.005 0.012 0)
    (-0.005 0.013 0)
    (-0.005 0.014 0)
    (-0.005 0.015 0)
    (-0.005 0.016 0)
    (-0.005 0.017 0)
    (-0.005 0.018 0)
    (-0.005 0.019 0)
    (-0.005 0.020 0)

    (-0.0025 0.001 0)
    (-0.0025 0.002 0)
    (-0.0025 0.003 0)
    (-0.0025 0.004 0)
    (-0.0025 0.005 0)
    (-0.0025 0.006 0)
    (-0.0025 0.007 0)
    (-0.0025 0.008 0)
    (-0.0025 0.009 0)
    (-0.0025 0.010 0)
    (-0.0025 0.011 0)
    (-0.0025 0.012 0)
    (-0.0025 0.013 0)
    (-0.0025 0.014 0)
    (-0.0025 0.015 0)
    (-0.0025 0.016 0)
    (-0.0025 0.017 0)
    (-0.0025 0.018 0)
    (-0.0025 0.019 0)
    (-0.0025 0.020 0)


    (0 0.001 0)
    (0 0.002 0)
    (0 0.003 0)
    (0 0.004 0)
    (0 0.005 0)
    (0 0.006 0)
    (0 0.007 0)
    (0 0.008 0)
    (0 0.009 0)
    (0 0.010 0)
    (0 0.011 0)
    (0 0.012 0)
    (0 0.013 0)
    (0 0.014 0)
    (0 0.015 0)
    (0 0.016 0)
    (0 0.017 0)
    (0 0.018 0)
    (0 0.019 0)
    (0 0.020 0)
)

// ************************************************************************* //
